lkolbly/cmsis-svd/data/TexasInstruments/LM3S9971.svd
        <register>
          <name>DC4</name>
          <description>Device Capabilities 4</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DC4_GPIOA</name>
              <description>GPIO Port A Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC4_GPIOB</name>
              <description>GPIO Port B Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC4_GPIOC</name>
              <description>GPIO Port C Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC4_GPIOD</name>
              <description>GPIO Port D Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC4_GPIOE</name>
              <description>GPIO Port E Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC4_GPIOF</name>
              <description>GPIO Port F Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC4_GPIOG</name>
              <description>GPIO Port G Present</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC4_GPIOH</name>
              <description>GPIO Port H Present</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC4_GPIOJ</name>
              <description>GPIO Port J Present</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC4_ROM</name>
              <description>Internal Code ROM Present</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC4_UDMA</name>
              <description>Micro-DMA Module Present</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC4_CCP6</name>
              <description>CCP6 Pin Present</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC4_CCP7</name>
              <description>CCP7 Pin Present</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC4_PICAL</name>
              <description>PIOSC Calibrate</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC4_E1588</name>
              <description>1588 Capable</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC4_EMAC0</name>
              <description>Ethernet MAC Layer 0 Present</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DC5</name>
          <description>Device Capabilities 5</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DC5_PWM0</name>
              <description>PWM0 Pin Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC5_PWM1</name>
              <description>PWM1 Pin Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC5_PWM2</name>
              <description>PWM2 Pin Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC5_PWM3</name>
              <description>PWM3 Pin Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC5_PWM4</name>
              <description>PWM4 Pin Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC5_PWM5</name>
              <description>PWM5 Pin Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC5_PWMESYNC</name>
              <description>PWM Extended SYNC Active</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC5_PWMEFLT</name>
              <description>PWM Extended Fault Active</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC5_PWMFAULT0</name>
              <description>PWM Fault 0 Pin Present</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC5_PWMFAULT1</name>
              <description>PWM Fault 1 Pin Present</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC5_PWMFAULT2</name>
              <description>PWM Fault 2 Pin Present</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC5_PWMFAULT3</name>
              <description>PWM Fault 3 Pin Present</description>
              <bitRange>[27:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DC6</name>
          <description>Device Capabilities 6</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DC6_USB0</name>
              <description>USB Module 0 Present</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DC6_USB0_OTG</name>
                  <description>USB0 is OTG</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DC6_USB0PHY</name>
              <description>USB Module 0 PHY Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DC7</name>
          <description>Device Capabilities 7</description>
          <addressOffset>0x00000028</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DC7_DMACH0</name>
              <description>USB_EP1_RX / UART2_RX</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH1</name>
              <description>USB_EP1_TX / UART2_TX</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH2</name>
              <description>USB_EP2_RX / Timer3A</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH3</name>
              <description>USB_EP2_TX / Timer3B</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH4</name>
              <description>USB_EP3_RX / Timer2A</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH5</name>
              <description>USB_EP3_TX / Timer2B</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH6</name>
              <description>ETH_RX / Timer2A</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH7</name>
              <description>ETH_TX / Timer2B</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH8</name>
              <description>UART0_RX / UART1_RX</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH9</name>
              <description>UART0_TX / UART1_TX</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH10</name>
              <description>SSI0_RX / SSI1_RX</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH11</name>
              <description>SSI0_TX / SSI1_TX</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH12</name>
              <description>CAN0_RX / UART2_RX</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH13</name>
              <description>CAN0_TX / UART2_TX</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH14</name>
              <description>ADC0_SS0 / Timer2A</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH15</name>
              <description>ADC0_SS1 / Timer2B</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH16</name>
              <description>ADC0_SS2</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH17</name>
              <description>ADC0_SS3</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH18</name>
              <description>Timer0A / Timer1A</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH19</name>
              <description>Timer0B / Timer1B</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH20</name>
              <description>Timer1A / EPI0_NBRFIFO</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH21</name>
              <description>Timer1B / EPI0_WFIFO</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH22</name>
              <description>UART1_RX / CAN2_RX</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH23</name>
              <description>UART1_TX / CAN2_TX</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH24</name>
              <description>SSI1_RX / ADC1_SS0</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH25</name>
              <description>SSI1_TX / ADC1_SS1</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH26</name>
              <description>CAN1_RX / ADC1_SS2</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH27</name>
              <description>CAN1_TX / ADC1_SS3</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH28</name>
              <description>I2S0_RX / CAN1_RX</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH29</name>
              <description>I2S0_TX / CAN1_TX</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC7_DMACH30</name>
              <description>SW</description>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DC8</name>
          <description>Device Capabilities 8 ADC Channels</description>
          <addressOffset>0x0000002C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DC8_ADC0AIN0</name>
              <description>ADC Module 0 AIN0 Pin Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN1</name>
              <description>ADC Module 0 AIN1 Pin Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN2</name>
              <description>ADC Module 0 AIN2 Pin Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN3</name>
              <description>ADC Module 0 AIN3 Pin Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN4</name>
              <description>ADC Module 0 AIN4 Pin Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN5</name>
              <description>ADC Module 0 AIN5 Pin Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN6</name>
              <description>ADC Module 0 AIN6 Pin Present</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN7</name>
              <description>ADC Module 0 AIN7 Pin Present</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN8</name>
              <description>ADC Module 0 AIN8 Pin Present</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN9</name>
              <description>ADC Module 0 AIN9 Pin Present</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN10</name>
              <description>ADC Module 0 AIN10 Pin Present</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN11</name>
              <description>ADC Module 0 AIN11 Pin Present</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN12</name>
              <description>ADC Module 0 AIN12 Pin Present</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN13</name>
              <description>ADC Module 0 AIN13 Pin Present</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN14</name>
              <description>ADC Module 0 AIN14 Pin Present</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN15</name>
              <description>ADC Module 0 AIN15 Pin Present</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN0</name>
              <description>ADC Module 1 AIN0 Pin Present</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN1</name>
              <description>ADC Module 1 AIN1 Pin Present</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN2</name>
              <description>ADC Module 1 AIN2 Pin Present</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN3</name>
              <description>ADC Module 1 AIN3 Pin Present</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN4</name>
              <description>ADC Module 1 AIN4 Pin Present</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN5</name>
              <description>ADC Module 1 AIN5 Pin Present</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN6</name>
              <description>ADC Module 1 AIN6 Pin Present</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN7</name>
              <description>ADC Module 1 AIN7 Pin Present</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN8</name>
              <description>ADC Module 1 AIN8 Pin Present</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN9</name>
              <description>ADC Module 1 AIN9 Pin Present</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN10</name>
              <description>ADC Module 1 AIN10 Pin Present</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN11</name>
              <description>ADC Module 1 AIN11 Pin Present</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN12</name>
              <description>ADC Module 1 AIN12 Pin Present</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN13</name>
              <description>ADC Module 1 AIN13 Pin Present</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN14</name>
              <description>ADC Module 1 AIN14 Pin Present</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN15</name>
              <description>ADC Module 1 AIN15 Pin Present</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PBORCTL</name>
          <description>Brown-Out Reset Control</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PBORCTL_BORIOR</name>
              <description>BOR Interrupt or Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCR0</name>
          <description>Software Reset Control 0</description>
          <addressOffset>0x00000040</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRCR0_WDT0</name>
              <description>WDT0 Reset Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR0_ADC0</name>
              <description>ADC0 Reset Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR0_ADC1</name>
              <description>ADC1 Reset Control</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR0_CAN0</name>
              <description>CAN0 Reset Control</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR0_CAN1</name>
              <description>CAN1 Reset Control</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR0_WDT1</name>
              <description>WDT1 Reset Control</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
